{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping four implemented contact/footer features (mailto links, Instagram link, Mumbai location, response time, form submission) to their source files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose and key details of every component and config file.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom property tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that assembles the full single-page layout by composing Navbar, HeroSection, AboutSection, ServicesSection, GallerySection, ContactSection, and Footer.",
  "frontend/src/components/AboutSection.tsx": "About section with a decorative blob image, asymmetric 12-column grid layout, brand story copy, and a row of three stat counters (years, sources, possibilities).",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying a clickable mailto email link, Mumbai studio location, 24–48 hour response notice, and an Instagram link, plus a form that opens a pre-filled mailto URI on submission.",
  "frontend/src/components/Footer.tsx": "Dark footer with AuraFlora logo, smooth-scroll navigation links, only an Instagram social icon linking to aura._.flora_, and contact details including a mailto email link, Mumbai, and a 24–48 hour response note.",
  "frontend/src/components/GallerySection.tsx": "Renders a masonry-style image gallery section with four botanical images in a responsive CSS grid, including hover effects and a decorative blob background element.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, decorative blurred blobs, headline text, two CTA buttons with smooth-scroll behavior, and an animated scroll indicator.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll-aware styling, smooth-scroll anchor links, a desktop nav with hover underline effects, and a collapsible mobile menu.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component displaying a service with an icon, title, description, decorative background blob, index number, and a hover-animated 'Discover' link.",
  "frontend/src/components/ServicesSection.tsx": "Renders a two-column grid of four ServiceCard components (bespoke arrangements, perfumery, gifting, event curation) with a section header and gradient background.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/index.css": "Global stylesheet defining the AuraFlora pastel design system using OKLCH CSS variables for light/dark themes, Tailwind base/components/utilities layers, and custom component styles like frosted-glass navbar and contact inputs.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with AuraFlora brand colors (OKLCH-based), custom fonts (Cormorant Garamond, Jost), border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file (version 7) describing AuraFlora as a high-class pastel-themed business website, listing all implemented features including hero, about, services, gallery, contact, navbar, and footer sections."
}