{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report confirming the logo replacement in Navbar and Footer components, referencing the generated logo asset and associated test/component metadata.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing the purpose and key changes of each component, context, and style file in the AuraFlora app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML shell for the AuraFlora React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that wraps the app in CartProvider and composes all page sections (Navbar, Hero, About, Products, Gallery, Contact, Footer, CartDrawer).",
  "frontend/src/components/AboutSection.tsx": "About section with an asymmetric grid layout featuring a large display heading, two body paragraphs, and three decorative feature highlight cards with symbols and enlarged titles.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out cart drawer showing cart items with quantity controls and subtotal, with an inline transition to the CheckoutForm component when the user proceeds.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form collecting name, email, and address with validation; on valid submission it shows an UnderConstructionModal instead of processing an order.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with a form that opens a mailto link on submission, plus displayed email, WhatsApp, and Instagram contact details.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, smooth-scroll navigation links, and social/contact links including Instagram, email, and WhatsApp.",
  "frontend/src/components/GallerySection.tsx": "Displays a masonry-style image gallery grid with four botanical images, hover zoom effects, and a decorative blob background element.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, brand name, tagline, and two CTA buttons that smooth-scroll to the gallery and about sections.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth-scroll links, a cart icon with item count badge, an enquiry CTA button, and a responsive mobile menu toggle.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with image, name, description, price, and an add-to-cart button that shows a confirmation state after being clicked.",
  "frontend/src/components/ProductsSection.tsx": "Defines a static array of six botanical products and renders them in a responsive grid using ProductCard components, with a styled section header.",
  "frontend/src/components/ServiceCard.tsx": "Empty file with no content.",
  "frontend/src/components/ServicesSection.tsx": "Empty file with no content.",
  "frontend/src/components/UnderConstructionModal.tsx": "A modal dialog that informs users checkout is under construction and provides contact buttons (email, WhatsApp, Instagram) as alternatives, with Escape key and backdrop-click dismissal.",
  "frontend/src/contexts/CartContext.tsx": "Provides a React context for cart state management, including add/remove/update/clear operations, item count, subtotal calculation, cart open/close state, and localStorage persistence.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via AuthClient, exposing a context provider and hook with login/clear functions, identity state, and login status tracking.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines the AuraFlora OKLCH color palette as CSS custom properties for both light and dark themes, plus reusable component classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the AuraFlora frontend, defining custom theme extensions including brand colors (oklch), fonts (Cormorant Garamond, Jost), border radii, box shadows, and plugins (typography, container-queries, animate) with dark mode support.",
  "project_state.json": "Tracks the AuraFlora project state at version 3, recording one existing feature (logo replacement in Navbar and Footer) and metadata such as clarification mode and schema version."
}