{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features in AboutSection.tsx: updated brand story paragraphs and replaced stat highlights with three new feature highlight cards.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short descriptions, serving as a reference summary of each component's role in the AuraFlora app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme tokens including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the AuraFlora React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that wraps the full page layout in CartProvider and composes all sections (Navbar, Hero, About, Products, Gallery, Contact, Footer, CartDrawer).",
  "frontend/src/components/AboutSection.tsx": "About section component with an asymmetric editorial layout, updated brand story paragraphs, and three feature highlight cards (Hand-Sculpted Florals, Artisanal Craftsmanship, Bespoke Creations).",
  "frontend/src/components/CartDrawer.tsx": "Slide-out cart drawer showing cart items with quantity controls and subtotal, with a transition to the CheckoutForm component when the user proceeds to checkout.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form that collects customer name, email, and delivery address, then constructs and opens a pre-filled mailto URI to hello.auraflora@gmail.com with itemized order details.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with a form that opens a mailto link on submission, plus displayed contact details (email, studio location, response time, Instagram).",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, smooth-scroll navigation links, Instagram social link, contact details, and a copyright bar.",
  "frontend/src/components/GallerySection.tsx": "Displays a masonry-style 3-column image grid of four botanical gallery images with hover zoom and gradient overlay effects.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with a background image, decorative blobs, headline, tagline, two CTA scroll buttons, and an animated scroll indicator.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth-scroll links, a cart icon with item count badge, an enquiry CTA button, and a responsive mobile hamburger menu.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product card with image, name, description, price, and an add-to-cart button that shows a brief confirmation state after clicking.",
  "frontend/src/components/ProductsSection.tsx": "Defines a static array of 6 botanical products and renders them in a responsive grid using ProductCard components, with a styled section header.",
  "frontend/src/components/ServiceCard.tsx": "Empty file with no content.",
  "frontend/src/components/ServicesSection.tsx": "Empty file with no content.",
  "frontend/src/contexts/CartContext.tsx": "Provides a React context for shopping cart state, supporting add/remove/update/clear operations with localStorage persistence and cart open/close UI state.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, recreating it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY AuthClient login/logout state, persisting identity across page reloads.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base styles, OKLCH CSS custom properties for the AuraFlora brand palette, and reusable component classes like contact/checkout inputs and navbar frosted glass.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with AuraFlora brand colors (OKLCH), custom fonts (Cormorant Garamond, Jost), border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the AuraFlora project state including existing features, architectural notes, known issues, and a pending request to update About Us page copy with new brand story paragraphs and feature highlights."
}