{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (ProductsSection, shopping cart, checkout flow, navbar update) to their associated files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence summaries of every frontend source file, describing each component's purpose and key implementation details.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for the light and dark theme design tokens used across the app.",
  "frontend/index.html": "Minimal HTML shell for the AuraFlora SPA, mounting the React app at the #root div and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root app component composing all page sections (Hero, About, Products, Gallery, Contact) with Navbar, Footer, and a global CartDrawer overlay.",
  "frontend/src/components/AboutSection.tsx": "Asymmetric editorial section presenting AuraFlora's brand story with a decorative blob image, display heading, body copy, and animated stat counters in a 12-column grid.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out cart drawer showing cart items with quantity controls, line totals, and a subtotal, with a Checkout button that transitions to the CheckoutForm component.",
  "frontend/src/components/CheckoutForm.tsx": "Checkout form collecting customer name, email, and delivery address that on submission opens a pre-filled mailto URI to aurafloraaf@gmail.com with itemized order details, then shows a confirmation state.",
  "frontend/src/components/ContactSection.tsx": "Renders a contact section with a form that opens a mailto link on submission, plus displayed contact details (email, studio location, response time, Instagram link).",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, smooth-scroll navigation links, Instagram social link, contact details, and a copyright bar.",
  "frontend/src/components/GallerySection.tsx": "Renders a masonry-style image gallery grid with four botanical images, including a tall item and a wide item, with hover zoom and overlay effects.",
  "frontend/src/components/HeroSection.tsx": "Renders the full-screen hero section with a background image, animated decorative blobs, headline, tagline, and CTA buttons that smooth-scroll to other sections.",
  "frontend/src/components/Navbar.tsx": "Renders a fixed navigation bar with scroll-aware styling, smooth-scroll nav links, a cart icon with item count badge, an enquire CTA, and a mobile hamburger menu.",
  "frontend/src/components/ProductCard.tsx": "Renders an individual product card with image, name, description, price, and an add-to-cart button that shows a temporary confirmation state after clicking.",
  "frontend/src/components/ProductsSection.tsx": "Defines a static list of 6 botanical products and renders them in a responsive grid using ProductCard components, with a styled section header.",
  "frontend/src/components/ServiceCard.tsx": "Empty file with no content.",
  "frontend/src/components/ServicesSection.tsx": "Empty file with no content.",
  "frontend/src/contexts/CartContext.tsx": "Provides a React context for shopping cart state, supporting add/remove/update/clear operations with localStorage persistence and cart open/close UI state.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, recreating it when the Internet Identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base styles, OKLCH-based CSS custom properties for the AuraFlora brand palette, and reusable component classes like contact/checkout inputs and navbar frosted glass.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with AuraFlora brand colors (OKLCH), custom fonts (Cormorant Garamond, Jost), border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of the AuraFlora website project (version 9), including feature IDs, architectural notes, image requirements, and known issues for a high-class pastel-themed business site."
}