{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report file with an empty features array, indicating no recorded feature evidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries for each frontend source file in the AuraFlora project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom property tokens for light and dark themes including colors, radius, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the AuraFlora React app, mounting the root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component that composes Navbar, HeroSection, AboutSection, ServicesSection, GallerySection, ContactSection, and Footer into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "Asymmetric editorial About section with a decorative blob image, large display heading, brand story copy, and animated stat counters in a 12-column offset grid.",
  "frontend/src/components/ContactSection.tsx": "Contact section with brand copy, contact details, and a form with name/email/message fields that shows a loading state and success confirmation on submission.",
  "frontend/src/components/Footer.tsx": "Dark-toned footer with AuraFlora logo, navigation links, social icons (Instagram, Facebook, Pinterest), contact info, and copyright attribution.",
  "frontend/src/components/GallerySection.tsx": "Masonry-style gallery section displaying four AuraFlora images in a mixed-span grid with hover zoom and gradient overlay effects.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section for AuraFlora with a background image, decorative blobs, headline, tagline, and two CTA buttons that smooth-scroll to other sections.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with scroll-aware frosted-glass styling, smooth-scroll anchor links, and a collapsible mobile menu.",
  "frontend/src/components/ServiceCard.tsx": "Reusable card component that displays a single service with an icon, title, description, decorative background blob, and a hover-animated 'Discover' arrow.",
  "frontend/src/components/ServicesSection.tsx": "Section that renders a 2-column grid of four ServiceCards (Bespoke Arrangements, Botanical Perfumery, Luxury Gifting, Event Curation) with a styled header.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook that manage DFINITY AuthClient lifecycle, login/logout state, and identity persistence across page reloads.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, defines the AuraFlora OKLCH color palette and semantic CSS variables for light/dark modes, and adds Tailwind component/utility layers including navbar and contact-input styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the AuraFlora frontend, extending the default theme with custom fonts, OKLCH-based color tokens (including brand-specific pastel colors), border radii, box shadows, and enabling dark mode, typography, container queries, and animation plugins.",
  "project_state.json": "Tracks the current state of the AuraFlora website project at schema version 1.0.0, listing existing features (hero, about, services, gallery, contact, navbar, footer sections) with their requirement IDs, architectural notes emphasizing pastel high-class aesthetics, and metadata flags like known issues and fix request status."
}