{
  "kind": "build_request",
  "title": "Update About Us page copy and feature highlights",
  "projectName": "AuraFlora",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the brand story paragraphs in the AboutSection component with the following two paragraphs (simple, warm tone — not overly formal): 'Our journey began with a quiet passion — to transform soft, textured fibers into enduring floral art. Each bloom is thoughtfully sculpted by hand, shaped petal by petal into creations that radiate warmth, charm, and individuality.' and 'As an emerging studio, we are devoted to craftsmanship, detail, and the beauty of slow creation. Every piece is formed with intention — a gentle balance of texture, color, and imagination — designed to bring lasting joy to any space.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Our journey began with a quiet passion — to transform soft, textured fibers into enduring floral art.",
          "As an emerging studio, we are devoted to craftsmanship, detail, and the beauty of slow creation."
        ]
      },
      "acceptanceCriteria": [
        "The About section displays both new paragraphs verbatim",
        "The tone is simple and warm, not overly formal or high-class",
        "Old placeholder paragraphs are removed"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace the three stat highlights in the AboutSection (currently '100% Natural Ingredients' and '50+ Curated Collections' and 'Handcrafted with Care') with the following three feature highlights: (1) Title: 'Hand-Sculpted Florals', Description: 'Every bloom is individually shaped with meticulous attention.' (2) Title: 'Artisanal Craftsmanship', Description: 'Created with patience, precision, and creative intention.' (3) Title: 'Bespoke Creations', Description: 'Custom hues and designs tailored to your vision.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Hand-Sculpted Florals\nEvery bloom is individually shaped with meticulous attention.",
          "Artisanal Craftsmanship\nCreated with patience, precision, and creative intention.",
          "Bespoke Creations\nCustom hues and designs tailored to your vision."
        ]
      },
      "acceptanceCriteria": [
        "The three stat/highlight items in the About section show the new titles and descriptions exactly as specified",
        "No references to '100% Natural Ingredients' or '50+ Curated Collections' remain",
        "Layout and styling of the highlight cards remain consistent with the existing design"
      ]
    }
  ],
  "constraints": [
    "Do not alter any other sections of the site",
    "Do not change the overall layout or visual style of the About section",
    "Keep the tone simple and approachable — not overly luxurious or formal"
  ],
  "nonGoals": [
    "Redesigning the About section layout",
    "Adding new images to the About section",
    "Changing any other page content or functionality",
    "Modifying the checkout or contact flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}