{
  "kind": "build_request",
  "title": "Replace Services section with a shoppable Products section",
  "projectName": "AuraFlora",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Replace the existing ServicesSection with a new ProductsSection component. Display a curated grid of AuraFlora products (at minimum 4–6 items), each shown as a luxury product card consistent with the existing pastel design system. Each card should include a product image placeholder, product name, a short description, a price, and an 'Add to Cart' or 'Buy Now' call-to-action button styled in the AuraFlora pastel palette with elegant hover effects.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "change the services page with products so that they can buy stuff"
        ]
      },
      "acceptanceCriteria": [
        "The ServicesSection and ServiceCard components are replaced or repurposed as a ProductsSection with product cards.",
        "Each product card displays a product image placeholder, name, short description, and price.",
        "Each card has an 'Add to Cart' or 'Buy Now' button styled to match the AuraFlora pastel theme.",
        "Cards use pastel-tinted backgrounds and hover animations consistent with the existing design system.",
        "The section heading is updated to reflect 'Products', 'Shop', or similar label."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Implement a client-side shopping cart. Users should be able to add products to a cart, view the cart (e.g. via a slide-out drawer or modal), see item quantities and a total price, and remove items. The cart UI must follow the AuraFlora pastel design system (frosted glass, soft pastel tones, serif headings).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "so that they can buy stuff"
        ]
      },
      "acceptanceCriteria": [
        "Clicking 'Add to Cart' adds the product to a cart state managed in React.",
        "A cart icon/button in the Navbar or page shows the current item count.",
        "Opening the cart displays all added items with name, quantity, unit price, and a line total.",
        "Users can increment, decrement, or remove items from the cart.",
        "A subtotal is displayed at the bottom of the cart.",
        "The cart UI is styled consistently with the AuraFlora pastel design system."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add a checkout flow that allows users to place an order by submitting their name, email, and delivery address. On submission, open a pre-filled mailto: URI to aurafloraaf@gmail.com with the order details (items, quantities, prices, customer info) as the email body, since no backend payment or order service is available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "so that they can buy stuff"
        ]
      },
      "acceptanceCriteria": [
        "A 'Checkout' or 'Place Order' button is present in the cart view.",
        "Clicking it opens a minimal checkout form requesting name, email, and delivery address.",
        "On form submission, a mailto: URI addressed to aurafloraaf@gmail.com is opened with order details pre-filled in the subject and body.",
        "The checkout form is styled to match the AuraFlora pastel aesthetic.",
        "A confirmation message is shown to the user after submission."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update the Navbar smooth-scroll link that previously pointed to the Services section so it now points to the new Products section anchor.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "change the services page"
        ]
      },
      "acceptanceCriteria": [
        "The navbar link label is updated from 'Services' (or equivalent) to 'Products' or 'Shop'.",
        "Clicking the navbar link smoothly scrolls to the ProductsSection."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the Footer navigation links so that any reference to the Services section is renamed to match the new Products/Shop section and scrolls to the correct anchor.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "change the services page"
        ]
      },
      "acceptanceCriteria": [
        "Footer link previously labeled 'Services' is updated to 'Products' or 'Shop'.",
        "The footer link scrolls to the ProductsSection anchor correctly."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/ or frontend/src/components/ui — these are immutable paths.",
    "No backend payment processing or external e-commerce APIs may be used; checkout must use a mailto: URI approach.",
    "Maintain the AuraFlora pastel design system (OKLCH tokens, Cormorant Garamond/Jost fonts, frosted-glass effects) across all new components."
  ],
  "nonGoals": [
    "Real payment gateway integration (Stripe, PayPal, etc.).",
    "Backend order management or database persistence.",
    "User authentication or account management for purchases.",
    "Inventory management or stock tracking."
  ],
  "imageRequirements": {
    "required": [
      "Elegant abstract pastel product placeholder — soft blush rose and champagne gold tones, botanical or floral abstract texture, square format (product-placeholder-1.dim_600x600.png)",
      "Elegant abstract pastel product placeholder — lavender mist and sage green tones, botanical or floral abstract texture, square format (product-placeholder-2.dim_600x600.png)",
      "Elegant abstract pastel product placeholder — champagne gold and blush rose tones, delicate petal motif, square format (product-placeholder-3.dim_600x600.png)",
      "Elegant abstract pastel product placeholder — sage green and lavender mist tones, soft watercolour floral texture, square format (product-placeholder-4.dim_600x600.png)"
    ],
    "edits": []
  }
}